{
  "id": "S4E6",
  "name": "The Cullodens' servant quarters",
  "episode": 6,
  "season": 4,
  "introduction": "“Hi, this is Bill from Culloden Manor. Listen...you're probably on your way here now, but some new developments have come up since we last spoke. You did get my other message, didn't you? About the place being actually haunted? Yes, well, there are even newer developments than that. There's a chance, a slight chance, that Mike Culloden was involved in some illegal dealings. We aren't sure yet about the details, but there's always a chance this could impact your inheritance. What we're trying to do now, and what you can help with when you get here, is taking on an investigation inside the Manor and seeing what information you can find out about the possible crimes. Be ready, though – none of this cancels out the fact that there are still ghosts lurking around.”\n You finish listening to Bill's latest message just as you finish climbing the enormous hill up to Culloden Manor. To be honest, you're not surprised by what you hear. Rich old men like Culloden were always involved in shady business, weren't they? And even though you'd love a share of what you assume is a pretty decent fortune, if Culloden stole from someone whose family deserves it more, it's only right that they get it. Either way, you want to be the one who discovers the solution to the mystery. Maybe you'll get famous. That'll be way better than a bit of money.\n There's no Bill in sight, but that's okay; he said in one of his earlier messages that he might be with the other Culloden descendants in his office, studying the ghosts they've been trapping all night. You don't need anyone's help finding criminal evidence inside a haunted house. You ignore the big 'CULLODENS KEEP OUT' message painted on the facade and push open the front door.\n You ignore bathrooms, basements, kitchens... you're looking for something very particular. You've read historical fiction. Whenever the master of the house has a secret, there's always one person who knows all the dirt: the manservant. If there's any evidence to be found, it'll be in his quarters. And if there's not, you can always ask his ghost. You locate a back staircase and head up, and at the top at the end of a short hallway, there's a single door, with ‘Todd McClary’ inscribed on it. Bingo.\n You open the door and step into the servant's quarters. It's a plain, simple room, with wooden floorboards rather than carpet or tile. On either side of the door is a large flower vase. Against the wall to your left is a vanity dresser (complete with a mirror), and you see a calendar sitting on it. Over in the far left corner is a bed. Besides this bed is a small table with a tray of bells sitting on it – must have been what the master of the house used to call Todd when he wanted something. To your right is an open door, which leads to a very small laundry area, not even large enough to walk into. Also along the right wall are an open shelf of folded linens and a closed wardrobe. Finally, in the very centre of the room is a second table, with all the accoutrement for tea on it.\n You walk further into the room, on the lookout for suspicious documents, when you hear the door close quietly behind you. Just the angle of the house? Or one of the infamous servant ghosts? When you hear the tell-tale click of a lock, you have your answer. Guess you're not getting out of here without a little exorcism.",
  "cheatsheet": "The first thing you my notice is a note sticking out from under the door, but if you move towards it, it's pulled back while somebody roars furiously in the hallway. It seems like Culloden yelling at his servant to get back to work, because he can clearly hear him dallying in the halls. The solution is for you to make a huge amount of noise – the kind of volume that can only be attained by setting an old-fashioned washing machine to its strongest settings. Do that, and the servant can get his note to you.\n The note says, “Three days from now I will help you escape. We can disguise you before he notices.” The emphasis on 'disguise' should tell you that this relates to the wardrobe, which is presumably full of clothes. If you look at the calendar, 'today' is October 10th, which means three days from now is October 13th. Plug that date into the combination lock on the wardrobe – either 1013 or 1310, depending on how your region does it – and it will open. Inside are several shirts, one of which matches the ones in the washing machine. That one happens to have a small rip in it. Well, when you approached the dresser to examine the calendar, you heard Culloden throwing a bell at the servant for not paying attention. One of the bells has a hooked end, which would certainly cause a shirt to rip. Look at this bell; it says on the inner rim 'ginger'. This is the bell Culloden rang when he wanted ginger tea.\n Each packet of tea has a funny barcode-like thing on it, with lines and circles. These lines represent the floorboards, and the circles are circling specific letters on it. Unscramble the letters to get ‘black’. There are a couple of black things in the room, though, so that won't be enough. Let's start another track.\n Buried in the linens is a round piece of glass that fits the hole in the dresser mirror. Stick it in, and it will reflect back on a segment of wall that can be removed. It's actually concealing a wheel, which belongs on the bed. Stick it back on, and you can move the bed away from the wall, revealing a colourful vent. Someone taps on the vent's grates from the other side in a specific order; purple, yellow, white, then they knock on the floor four times. These go with the words inscribed on the bottom of the table, to form a poem:\n [Purple] together\n [Yellow] apart\n [White] with white\n [Four] per heart.\n This is talking about the heart-shaped vases and the flowers in them. You need to separate the flowers so there are four per vase, with all the white ones together, the two yellows apart, and the two purples together. So, you should end up with Purple, Purple, Yellow and Pink in one vase, and Yellow, White, White and White in the other. While doing this you'll discover a little guide to recognising flowers attached to one of the flower stems, and you can figure out what flowers you've got. In one vase you've got fuchsia, lavender, ursinia and lily; in the other you've got marigold, two orchids and a narcissus. (The ursinia and marigold could be swapped, but it'll soon be obvious why that won't work.) Unscramble the letters and you'll get the words FULL MOON.\n On the calendar, there's only one full moon marked, for Saturday. And when you discover this, you hear the servant's voice, apologising profusely to someone, saying that they can't go through with the plan because Culloden will rip him to pieces. He really emphasises that last bit. That's because what you need to do is find the black Saturday linen (black from the floorboards, Saturday from the calendar), and rip it up. The pieces will capture your ghost.",
  "conclusion": "You grab the black Saturday linen and pull hard on it from either end. It tears much easier than you expected, ripping a neat, long line straight down the middle. As you hold the two pieces in your hands, you think you hear a horrified gasp. But all that does is prove that you're not done; you take both pieces and rip them in half again. And again.\n “No,” the gasping voice says. He sounds panic-stricken. “No, no, no...”\n The door handle rattles, then the whole thing flies open, but it's too late. One of the pieces of linen you're holding shudders and pulls towards the invisible man, and he in turn is pulled towards it. You can see the door flapping as he tries to grip it to stop himself being sucked in, but it doesn't work. You can't see it, but you can feel it: he is dragged into the piece of linen like water whirlpooling down a drain. With one final, tearful breath, he cries, “Forgive me!”\n Then he's gone forever. Well, trapped, at least. And the door's open. But you didn't find any evidence of Culloden's crimes, which is a disappointment. And it would've been nice if you'd managed to catch the loud, angry ghost rather than the quiet, terrified one. Guess you couldn't do this alone after all. Maybe you should take Todd out to Bill so he can study him, and you can tell him what you heard in here. You might not have learned anything helpful on its own, but Bill's been researching this family for a while. Maybe he can put your piece into the bigger puzzle.",
  "items": [
    {
      "name": "Bed",
      "description": "It's a simple bed, with no special effort having been made for a mere servant. It hasn't even been kept well- it's on wheels, but only three wheels. One of its legs is scraping the floorboards."
    },
    {
      "name": "Bells",
      "description": "The tray of bells is completely covered. Bells of different sizes are all pressed together. The interesting thing about them, strangely, are not the main bodies of the bells – each bell has a different handle on top by which to hold it. There are circular ones, triangular ones, some that are just vertical sticks of metal, all sorts."
    },
    {
      "name": "Calendar",
      "description": "It's a month-by-month calendar, with the previous months torn off. Looks like this is genuinely from Culloden's time. Dates have been crossed off all the way up to the tenth of October. As you examine this date, all of a sudden you hear a furious roar come from behind you."
    },
    {
      "name": "Clothes",
      "description": "For a servant, this guy had a lot of clothes. You wouldn't describe any of them as fancy, exactly, but clearly Culloden liked his employees looking their best. There are suits, all manner of formal shirts, and many ties, both long and bow. Right up the end there's one grey shirt similar to the ones you found in the laundry. They must've been the ones he wore most often."
    },
    {
      "name": "Door",
      "description": "The door itself is astoundingly normal, so much so that you barely find it worth your time to examine. However, while you waste your time looking at it for clues, something interesting happens- a piece of paper is slipped underneath it towards you. It looks like there's writing on it."
    },
    {
      "name": "Dresser",
      "description": "There's nothing on the dresser besides the calendar, and its drawers are empty. The mirror of the dresser is broken, with one shard missing – a very peculiar shard. It's almost perfectly circular. That can't have been done by accident."
    },
    {
      "name": "Floorboards",
      "description": "That's interesting. For the most part the floorboards look totally ordinary, but at the very ends of each board you see a letter carved into the wood. The board nearest to the door has a Y at one end, Z at the other. The next board has a W and an X. Ah, you see where this is going. Sure enough, there are 13 boards that make up this wooden floor, and from what you can see, each board has two letters of the alphabet at either end, going sequentially. You wonder why someone would do that."
    },
    {
      "name": "Flowers",
      "description": "The lone flower is white. In the full vase, you count seven flowers: two purple, two yellow, two white and one pink."
    },
    {
      "name": "Laundry",
      "description": "In this laundry area you see possibly the most primitive washing machine in existence. It must be from the day they were first invented. But you know, it almost looks like you could understand how to use it. There's a dial labelled “Wash strength”, with options ranging from 1 to 5, and inside the machine you count six long-sleeved grey shirts."
    },
    {
      "name": "Linens",
      "description": "The rack of linens is impeccably stacked, and even labelled. It's split into seven sections, one labelled for each day of the week. Every day has an identical stack of various coloured sheets; these must go to all the bedrooms of the house. They make the guy change the sheets every day? Well, maybe people were a lot dirtier back then."
    },
    {
      "name": "Table",
      "description": "This is a perfectly ordinary bedside table."
    },
    {
      "name": "Tea",
      "description": "This tea table is littered with small, square packets that presumably contain loose tea. Flavours are written on the front of each bag – you see at least one of every flavour you can imagine – and on the back, you see something that almost looks like a barcode, only it's got circles as well as stripes in it. Would they have even had barcodes back then?"
    },
    {
      "name": "Vases",
      "description": "The vases have no interesting patterns on them, but they are an unusual shape. Both of them have a distinct heart shape to them. One of the vases is full of flowers, but the other contains only one."
    },
    {
      "name": "Vent",
      "description": "You can't see where this vent would lead, though the extra musty smell makes you suspect the attic. You can't exactly crawl through to find out, though, because there's a solid grate blocking it off. Looking closely at this grate, you think you see a tinge of colour to them, like someone's taken a crayon and drawn a line along each bar of the grate. There are four bars, each lined with a different colour- going top to bottom, there's pink, purple, yellow and white. And while you examine these, something makes you jump back- a knocking, coming from the other side of the grate. The first one is loud enough to give you a shock, but then a second one comes and it's a bit softer. Then a third, so soft you can barely hear it. Then in quick succession come four very echoey ones.",
      "dependantOn": "Moving the bed now that all its wheels are attached"
    },
    {
      "name": "Wardrobe",
      "description": "It's a simple old closet where you'd store your clothes, only perhaps there's something more valuable inside, because there's an old-fashioned combination lock holding the handles shut."
    }
  ],
  "actions": {
    "Bed": [
      {
        "name": "Attempting to move it on three wheels",
        "description": "For something so no-frills, it's shockingly hard to move. The leg without a wheel is digging into the wooden floor, sticking enough that you just can't get it to move."
      },
      {
        "name": "Reattaching the missing wheel found in the wall",
        "description": "It takes a remarkable amount of effort to lift even this one leg, but finally you get it off the ground enough to stick the wheel in under it. It clicks into place. The bed is now level.",
        "dependantOn": "Examining the wall seen in the missing piece of mirror"
      },
      {
        "name": "Moving the bed now that all its wheels are attached",
        "description": "That's better. The bed moves seamlessly across the floorboards. You roll it away from the wall, and see that it was concealing a rather large vent in the lower part of the wall.",
        "dependantOn": "Reattaching the missing wheel found in the wall"
      }
    ],
    "Bells": [
      {
        "name": "Ringing them at random",
        "description": "Each bell has a distinct sound. You suppose that's so Todd can tell what his master wants without having to be told."
      },
      {
        "name": "Looking on the insides of them at random",
        "description": "Interesting. Each bell has a word engraved on its inner rim. One says 'bath'. Another says 'pipe'. Oh, you get it. Whenever the master wants something, he rings a specific bell. Todd must know how each individual bell sounds, so he can recognise what he needs to do without having to go and ask."
      },
      {
        "name": "Looking for one with a very sharp end",
        "description": "Lots of these bells have handles that are sort of pointy, but only one is sharp enough to cause something to tear. It looks like a miniature version of Captain Hook's hand.",
        "dependantOn": "Examining the grey shirt like the ones in the laundry"
      },
      {
        "name": "Looking at the inside of hook-ended bell",
        "description": "Interesting. Inside this bell you see the word 'ginger' engraved in the metal.",
        "dependantOn": "Looking for one with a very sharp end"
      }
    ],
    "Calendar": [
      {
        "name": "Looking for a full moon",
        "description": "You search the calendar, and there are some little symbols indicating the important phases of the moon. There's just one full one: on the upcoming Saturday. As you run your finger over it, a cold chill hits the back of your neck as a sudden breeze enters the room. You hear a voice, but not the angry voice you’ve been hearing so much already:\n “I’m sorry. I can’t do it. Master Culloden – he knows. I’m sure he knows. And if I try, he’ll rip me to pieces.”\n The last words echo throughout the room. “Rip me to pieces... rip me to pieces...”",
        "dependantOn": "Reading the guide to figure out which flowers you have & rearranging the letters to get FULL MOON"
      }
    ],
    "Clothes": [
      {
        "name": "Examining the grey shirt like the ones in the laundry",
        "description": "It's clean and neatly pressed, but there's one big problem with it: a thin rip running down the front near the breast pocket. It's an odd place to tear your clothing; you wonder how he could have done this."
      }
    ],
    "Door": [
      {
        "name": "Reaching for the note WITHOUT starting the washing machine at the strongest setting",
        "description": "You bend down to grab the note, but before your fingers touch it you hear an enraged shout from somewhere far away on the other side of the door. “TODD!” it hollers. “I CAN HEAR YOU, SHUFFLING ABOUT IN THE HALL! IF I CAN HEAR YOU, THAT MEANS YOU'RE NOT WORKING!” As if that wasn't bad enough, the note is whisked away back under the door. It isn't until you've taken several steps back that it slides into view again."
      },
      {
        "name": "Reaching for the note while the washing machine is on its strongest setting",
        "description": "The note sits on the floor, tantalisingly close as you bend down to grab it... and nothing stops you. You've got it! You quickly flip it over and see neat handwriting on the other side: Three days from now I will help you escape. We can disguise you before he notices.",
        "dependantOn": "Setting the washing machine to its strongest setting"
      }
    ],
    "Dresser": [
      {
        "name": "Examining the wall seen in the missing piece of mirror",
        "description": "You can't see anything different about this area of the wall, but when you touch it, it feels flimsy. Like a cheap patching job. You poke at it and sure enough, there's a hole back here. You reach in and pull out... a wheel? Yeah, a small, metal wheel that fits in the palm of your hand.",
        "dependantOn": "Replacing missing piece of mirror found in the linens"
      },
      {
        "name": "Replacing missing piece of mirror found in the linens",
        "description": "It's a perfect fit, slotting into the empty mirror spot and reflecting a small segment of wall next to the linen rack.",
        "dependantOn": "Searching through the folded sheets"
      }
    ],
    "Flowers": [
      {
        "name": "Moving flowers from one vase to another",
        "description": "You pick up some of the flowers and transfer them between vases. As you do, you spot something you couldn't inside the darkness of the vase: one of the flower stems has a paper curled up around it. It's a bit wet from water in the vase, so you have to very carefully unwrap it. Luckily its ink hasn't run too badly, and it's mostly intact. It's a small guide to recognising different kinds of flowers.",
        "dependantOn": "Knocking on the different grates to hear the different sounds they make & looking at underside of table"
      },
      {
        "name": "Reading the guide to figure out which flowers you have",
        "description": "It's tricky, but you're pretty sure you're identifying these correctly. One of the white ones is a narcissus, and the other two are orchids. The two purples are fuchsia and lavender, the two yellows are marigold and ursinia, and the pink one is a lily."
      }
    ],
    "Laundry": [
      {
        "name": "Starting a load of washing",
        "description": "You twist the dial to 'regular', and the machine starts up perfectly, like it's been waiting all these years for this moment. That said, it's definitely old, and not something you'd want to use. It's kind of grumbly and grindy. It's just that level of loud that it would be annoying to have to live with."
      },
      {
        "name": "Setting the washing machine to its strongest setting",
        "description": "The machine rumbles so hard it shakes the floor under your feet, and it positively roars. You can barely hear yourself think. You hope this isn't a long cycle."
      }
    ],
    "Linens": [
      {
        "name": "Searching through the folded sheets",
        "description": "You twist the dial to 'regular', and the machine starts up perfectly, like it's been waiting all these years for this moment. That said, it's definitely old, and not something you'd want to use. It's kind of grumbly and grindy. It's just that level of loud that it would be annoying to have to live with."
      },
      {
        "name": "Ripping to pieces the black Saturday linen",
        "isFinalAction": true
      }
    ],
    "Table": [
      {
        "name": "Looking at underside",
        "description": "There's something written under here. Carved in rough letters on the bottom of the table are the words: TOGETHER APART WITH WHITE PER HEART."
      }
    ],
    "Tea": [
      {
        "name": "Looking for ginger flavour",
        "description": "There is indeed, among all the packets, a single one of ginger tea.",
        "dependantOn": "Looking at the inside of hook-ended bell"
      },
      {
        "name": "Looking at 'barcode' for ginger tea",
        "description": "Like all the others, its barcode is made up of several lines and circles.",
        "image": "tea.png",
        "dependantOn": "Looking for ginger flavour"
      }
    ],
    "Vent": [
      {
        "name": "Knocking on the different grates to hear the different sounds they make",
        "description": "You knock on a few different places, and each grate must have a different composition because the volume of each knock is quite different. The pink is totally inaudible, no echo at all. The purple one is really loud, then the yellow a bit softer, and the white incredibly soft. However, none of them makes the really echoey sound you heard four times from your invisible communicator. Perhaps they were just knocking on the vent floor for that one?"
      }
    ],
    "Wardrobe": [
      {
        "name": "Unlocking with code 1013 or 1310 from calendar",
        "description": "The lock clicks, and you open the wardrobe door, hoping for something great... but it's just clothes.",
        "dependantOn": "Looking for a full moon"
      }
    ]
  }
}